# TODO

1. [ ] there isn't `hotel_cluster` label in test data??

# Package

In [1]:
# ! pip install pandas_profiling

In [20]:
import pandas as pd
import pandas_profiling
from pprint import pprint

# Config

In [14]:
target_col = 'is_booking'

# Basic data info

In [6]:
train_df = pd.read_csv('../data/raw_data/train.csv'
#                        , nrows=100000
                      )

In [10]:
test_df = pd.read_csv('../data/raw_data/test.csv')

In [156]:
destination_df = pd.read_csv('../data/raw_data/destinations.csv')

In [63]:
submission_df = pd.read_csv('../data/raw_data/sample_submission.csv')

In [157]:
print(f"train: {train_df.shape}; test: {test_df.shape}; submission: {submission_df.shape}; destination: {destination_df.shape}")

train: (37670293, 24); test: (2528243, 22); submission: (2528243, 2); destination: (62106, 150)

In [66]:
submission_df.head()

   id hotel_cluster
0   0          99 1
1   1          99 1
2   2          99 1
3   3          99 1
4   4          99 1

In [67]:
len(submission_df['id'].unique())

2528243

In [12]:
set(train_df.columns) - set(test_df.columns)

{'cnt', 'hotel_cluster', 'is_booking'}

In [13]:
set(test_df.columns) - set(train_df.columns)

{'id'}

## Date

In [185]:
train_df['date_time'].head()

0    2014-08-11 07:46:59
1    2014-08-11 08:22:12
2    2014-08-11 08:24:33
3    2014-08-09 18:05:16
4    2014-08-09 18:08:18
Name: date_time, dtype: object

In [176]:
train_df['year'] = pd.to_datetime(train_df['date_time']).dt.year
train_df['month'] = pd.to_datetime(train_df['date_time']).dt.month
train_df['day'] = pd.to_datetime(train_df['date_time']).dt.day

In [174]:
train_df['year'].value_counts()

2014    26483412
2013    11186881
Name: year, dtype: int64

In [175]:
train_df['month'].value_counts()

7     3893567
8     3773730
12    3746582
10    3705635
9     3700667
11    3434723
6     3190844
5     2840308
3     2743173
4     2712327
2     1975372
1     1953365
Name: month, dtype: int64

In [172]:
pd.to_datetime(train_df['date_time']).dt.yera

In [177]:
test_df['year'] = pd.to_datetime(test_df['date_time']).dt.year
test_df['month'] = pd.to_datetime(test_df['date_time']).dt.month
test_df['day'] = pd.to_datetime(test_df['date_time']).dt.day

In [179]:
test_df['year'].value_counts()

2015    2528243
Name: year, dtype: int64

In [181]:
test_df['month'].value_counts()

3     251646
7     238044
6     237412
5     231979
4     223917
8     223742
2     220614
9     196494
1     196332
10    186424
11    167820
12    153819
Name: month, dtype: int64

In [182]:
test_df['day'].value_counts()

8     89592
9     89099
13    88033
15    87464
10    86958
16    86775
14    86128
12    85855
11    85250
23    85147
22    85007
27    84405
17    84204
20    83654
19    83395
18    83372
28    83102
21    82840
26    81597
2     80435
24    80190
3     79609
25    79527
6     78099
30    77923
1     77845
7     77390
29    76852
4     76801
5     76466
31    45229
Name: day, dtype: int64

# Target Variable  -> book_rate=0.080

In [16]:
train_df[target_col].value_counts()

0    34669600
1     3000693
Name: is_booking, dtype: int64

In [15]:
train_df[target_col].value_counts()/len(train_df)

0    0.920343
1    0.079657
Name: is_booking, dtype: float64

# Users

In [45]:
print(f"train_df: min: {min(train_df['user_id'])}; max: {max(train_df['user_id'])}")
print(f"test_df: min: {min(test_df['user_id'])}; max: {max(test_df['user_id'])}")

train_df: min: 0; max: 1198785
test_df: min: 0; max: 1198785

In [49]:
train_df['user_id'].value_counts()

1187360    530
1040395    501
124565     498
1043120    495
783124     491
          ...
981025       2
669302       2
73844        2
909245       2
886682       2
Name: user_id, Length: 1198786, dtype: int64

In [60]:
frac_df = (round(train_df['user_id'].value_counts()/10)*10).reset_index().rename(columns={
    'user_id': 'sample_num_frac'
})

In [61]:
frac_df

           index  sample_num_frac
0        1187360            530.0
1        1040395            500.0
2         124565            500.0
3        1043120            500.0
4         783124            490.0
...          ...              ...
1198781   981025              0.0
1198782   669302              0.0
1198783    73844              0.0
1198784   909245              0.0
1198785   886682              0.0

[1198786 rows x 2 columns]

In [62]:
frac_df['sample_num_frac'].value_counts().reset_index().rename(columns={
    'sample_num_frac': 'user_num',
    'index': 'sample_num_frac'
}).sort_values('sample_num_frac', ascending=False)

    sample_num_frac  user_num
51            530.0         1
49            500.0         3
50            490.0         2
48            480.0         7
47            470.0         9
46            460.0        13
45            450.0        19
44            440.0        41
43            430.0        43
42            420.0        60
41            410.0        78
39            400.0       160
40            390.0       158
38            380.0       208
37            370.0       242
35            360.0       356
36            350.0       290
33            340.0       455
34            330.0       454
32            320.0       626
31            310.0       639
29            300.0       824
30            290.0       785
27            280.0      1077
28            270.0       971
25            260.0      1427
26            250.0      1268
23            240.0      1753
24            230.0      1603
21            220.0      2336
22            210.0      2131
19            200.0      2762
20            190.0      2699
17            180.0      3786
18            170.0      3576
15            160.0      5075
16            150.0      4828
13            140.0      6931
14            130.0      6697
11            120.0      9783
12            110.0      9703
10            100.0     14335
9              90.0     14821
8              80.0     23102
7              70.0     24262
6              60.0     39688
5              50.0     44222
4              40.0     77600
3              30.0     96513
2              20.0    201683
0              10.0    348352
1               0.0    240329

# Hotels  -> 100 hotel_clusters

In [44]:
print(f"train_df: min: {min(train_df['hotel_cluster'])}; max: {max(train_df['hotel_cluster'])}")
print(f"test_df: min: {min(test_df['id'])}; max: {max(test_df['id'])}")

train_df: min: 0; max: 99
test_df: min: 0; max: 2528242

In [17]:
train_df['hotel_cluster'].value_counts()

91    1043720
41     772743
48     754033
64     704734
65     670960
       ...
35     139122
53     134812
88     107784
27     105040
74      48355
Name: hotel_cluster, Length: 100, dtype: int64

In [22]:
train_df['hotel_cluster'].value_counts()/len(train_df)

91    0.027707
41    0.020513
48    0.020017
64    0.018708
65    0.017811
        ...
35    0.003693
53    0.003579
88    0.002861
27    0.002788
74    0.001284
Name: hotel_cluster, Length: 100, dtype: float64

In [35]:
frac_df

    index  sample_num_frac
0      91            0.028
1      41            0.021
2      48            0.020
3      64            0.019
4      65            0.018
..    ...              ...
95     35            0.004
96     53            0.004
97     88            0.003
98     27            0.003
99     74            0.001

[100 rows x 2 columns]

In [43]:
frac_df['sample_num_frac'].value_counts().reset_index().rename(columns={
    'sample_num_frac': 'hotel_cluster_num',
    'index': 'sample_num_frac'
}).sort_values('sample_num_frac', ascending=False)

    sample_num_frac  hotel_cluster_num
14            0.028                  1
16            0.021                  1
17            0.020                  1
19            0.019                  1
15            0.018                  1
11            0.016                  2
10            0.015                  3
7             0.014                  7
3             0.013                 10
8             0.012                  6
5             0.011                  8
6             0.010                  8
0             0.009                 11
2             0.008                 11
1             0.007                 11
4             0.006                 10
13            0.005                  1
9             0.004                  4
12            0.003                  2
18            0.001                  1

min: 0; max: 99

# Destination

In [164]:
train_df['srch_destination_id'].value_counts()

8250     1333657
8267     1005794
8791      619520
8268      529007
8253      498195
          ...
9034           1
9040           1
60961          1
9052           1
46970          1
Name: srch_destination_id, Length: 59455, dtype: int64

In [165]:
train_df[train_df[target_col]==1]['srch_destination_id'].value_counts()

8250     97678
8267     57680
8279     30320
8253     28297
8745     25713
         ...
16830        1
15948        1
35639        1
11849        1
35864        1
Name: srch_destination_id, Length: 36933, dtype: int64

# Baseline -> PopularRec excluding historical bookings

In [168]:
pop_booking = train_df[train_df[target_col]==1].groupby('srch_destination_id')['hotel_'].apply(list).reset_index()

In [169]:
pop_booking

       srch_destination_id                                            user_id
0                        1  [732251, 999935, 1004739, 1004739, 274173, 119...
1                        2                                            [95132]
2                        4  [146060, 676665, 1039655, 1041278, 1041278, 67...
3                        7                           [1058859, 625412, 65514]
4                        8  [351451, 381314, 666715, 777152, 1028468, 8309...
...                    ...                                                ...
36928                65049                                           [615340]
36929                65051                    [730961, 730961, 13984, 925234]
36930                65054                                           [192835]
36931                65102                                 [1164199, 1164199]
36932                65104                                            [28604]

[36933 rows x 2 columns]

# PopRec based on destination

In [155]:
train_df.shape

(37670293, 24)

 # Baseline -> random excluding historical bookings

In [70]:
pop_lst = train_df[train_df[target_col]==1]['hotel_cluster'].value_counts().reset_index().rename(columns={
    "index": 'hotel_cluster'
    , 'hotel_cluster': 'bookings'
})

In [130]:
' '.join([str(ele) for ele in pop_lst.head(5)['hotel_cluster'].values.tolist()])

'91 48 42 59 28'

In [138]:
# def get_pop_rec(x, pop_lst):
#     hotel_lst = x['hotel_cluster'].unique().tolist()
#     res = []
# #     print(hotel_lst)
#     while len(res)<5 and len(pop_lst)>0:
#         current = pop_lst.pop(-1)
#         if current not in hotel_lst:
#             res.append(str(current))
#         else:
#             continue
#     return ' '.join(res)

import random
def get_random_rec(x, pop_lst):
    hotel_lst = x['hotel_cluster'].unique().tolist()
    res = []
    random.shuffle(pop_lst)
#     print(hotel_lst)
    while len(res)<5 and len(pop_lst)>0:
        current = pop_lst.pop(-1)
        if current not in hotel_lst:
            res.append(str(current))
        else:
            continue
    return ' '.join(res)

In [82]:
pop_hotel_lst = pop_lst['hotel_cluster'].values.tolist()

In [83]:
pop_hotel_lst.reverse()

In [98]:
# pop_hotel_lst
from copy import deepcopy

In [102]:
train_df['user_id'].head()

0    12
1    12
2    12
3    93
4    93
Name: user_id, dtype: int64

In [140]:
# use_res = train_df[train_df['user_id']==1187360].groupby('user_id').apply(lambda x: get_random_rec(x, deepcopy(pop_hotel_lst)))

In [142]:
# use_res

In [143]:
use_res = train_df.groupby('user_id').apply(lambda x: get_random_rec(x, deepcopy(pop_hotel_lst)))

In [144]:
use_res.head()

user_id
0     77 84 11 7 78
1     13 76 92 66 0
2      58 64 6 0 20
3    15 20 11 56 64
4     58 42 5 35 86
dtype: object

In [145]:
res_df = use_res.reset_index().rename(columns={
    0:'hotel_cluster' 
    , 'user_id': 'id'
})

In [146]:
res_df

              id   hotel_cluster
0              0   77 84 11 7 78
1              1   13 76 92 66 0
2              2    58 64 6 0 20
3              3  15 20 11 56 64
4              4   58 42 5 35 86
...          ...             ...
1198781  1198781   64 49 35 1 36
1198782  1198782    2 8 57 16 44
1198783  1198783   79 95 81 0 46
1198784  1198784   35 3 64 34 21
1198785  1198785   25 31 34 9 78

[1198786 rows x 2 columns]

In [147]:
submission_df = submission_df.drop('hotel_cluster', axis=1)

In [148]:
submission_df = submission_df.merge(res_df, how='left', on='id')

In [149]:
submission_df['hotel_cluster'] = submission_df['hotel_cluster'].fillna('91 48 42 59 28')

In [150]:
submission_df['hotel_cluster'].isna().sum()

0

In [151]:
submission_df['hotel_cluster'].sample(10)

851701      77 30 8 51 62
1662595    91 48 42 59 28
503300     61 59 94 71 52
1409034    91 48 42 59 28
1773810    91 48 42 59 28
1562762    91 48 42 59 28
1316332    91 48 42 59 28
650447      55 63 36 30 4
1037037     51 29 25 66 5
387539     13 28 64 51 91
Name: hotel_cluster, dtype: object

In [152]:
# submission_df.to_csv('../result/0901_pop_rec_exclude_booked.csv', index=False)
submission_df.to_csv('../result/0901_random_rec_exclude_booked.csv', index=False)

# Debug data

In [183]:
debug_train = pd.read_csv('../data/debug_data/train.csv')

In [184]:
debug_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 24 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   date_time                  10000 non-null  object
 1   site_name                  10000 non-null  int64
 2   posa_continent             10000 non-null  int64
 3   user_location_country      10000 non-null  int64
 4   user_location_region       10000 non-null  int64
 5   user_location_city         10000 non-null  int64
 6   orig_destination_distance  6461 non-null   float64
 7   user_id                    10000 non-null  int64
 8   is_mobile                  10000 non-null  int64
 9   is_package                 10000 non-null  int64
 10  channel                    10000 non-null  int64
 11  srch_ci                    9990 non-null   object
 12  srch_co                    9990 non-null   object
 13  srch_adults_cnt            10000 non-null  int64
 14  srch_children_cnt          10000 non-null  int64
 15  srch_rm_cnt                10000 non-null  int64
 16  srch_destination_id        10000 non-null  int64
 17  srch_destination_type_id   10000 non-null  int64
 18  is_booking                 10000 non-null  int64
 19  cnt                        10000 non-null  int64
 20  hotel_continent            10000 non-null  int64
 21  hotel_country              10000 non-null  int64
 22  hotel_market               10000 non-null  int64
 23  hotel_cluster              10000 non-null  int64
dtypes: float64(1), int64(20), object(3)
memory usage: 1.8+ MB

In [187]:
new_df = train_df[train_df['date_time']>'2014-12-23 07:46:59']

In [188]:
max(new_df['date_time'])

'2014-12-31 23:59:59'

In [189]:
min(new_df['date_time'])

'2014-12-23 07:47:00'